orgs/2015-06-29-yhxw.org
* Ocean用户行为分析
** 导语
Ocean用户行为分析，是指在获得新闻访问量基本数据的情况下，
对有关数据进行统计、分析，从中发现用户访问新闻的规律，
为进一步修正或重新制定营销策略提供依据。

** 目标是什么
+ 用户行为分析应该包含以下数据重点分析：
+ 用户的来源地区、来路域名和页面；
+ 用户在网站的停留时间、跳出率、回访者、新访问者、回访次数、回访相隔天数；
+ 注册用户和非注册用户，分析两者之间的浏览习惯；
+ 用户所使用的搜索引擎、关键词、关联关键词和站内关键字；
+ 用户选择什么样的入口形式（广告或者网站入口链接）更为有效；
+ 用户访问网站流程，用来分析页面结构设计是否合理；
+ 用户在页面上的网页热点图分布数据和网页覆盖图数据；
+ 用户在不同时段的访问量情况等：
+ 用户是否对于网站的字体颜色的喜好程度。

** 接入数据模型
*** 数据模型
*** 报文格式定义
*** 参数定义与规范

** WFT客户端如何接入

*** 正文请求
*** 列表请求

** 手机客户端如何接入

*** 正文请求

** 相关参数定义
