_posts/2015-06-29-yhxw.html
<!--?xml version="1.0" encoding="utf-8"?-->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en"><head>
<title>2015-06-29-yhxw</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta name="title" content="2015-06-29-yhxw">
<meta name="generator" content="Org-mode">
<meta name="generated" content="2015-06-29T18:33+0800">
<meta name="author" content="ym">
<meta name="description" content="">
<meta name="keywords" content="">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2015-06-29-yhxw</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Ocean用户行为分析</a>
<ul>
<li><a href="#sec-1-1">1.1 导语</a></li>
<li><a href="#sec-1-2">1.2 目标是什么</a></li>
<li><a href="#sec-1-3">1.3 接入数据模型</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 数据模型</a></li>
<li><a href="#sec-1-3-2">1.3.2 报文格式定义</a></li>
<li><a href="#sec-1-3-3">1.3.3 参数定义与规范</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 WFT客户端如何接入</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 正文请求</a></li>
<li><a href="#sec-1-4-2">1.4.2 列表请求</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 手机客户端如何接入</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 正文请求</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 相关参数定义</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ocean用户行为分析</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 导语</h3>
<div class="outline-text-3" id="text-1-1">

<p>Ocean用户行为分析，是指在获得新闻访问量基本数据的情况下，
对有关数据进行统计、分析，从中发现用户访问新闻的规律，
为进一步修正或重新制定营销策略提供依据。
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 目标是什么</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>用户行为分析应该包含以下数据重点分析：
</li>
<li>用户的来源地区、来路域名和页面；
</li>
<li>用户在网站的停留时间、跳出率、回访者、新访问者、回访次数、回访相隔天数；
</li>
<li>注册用户和非注册用户，分析两者之间的浏览习惯；
</li>
<li>用户所使用的搜索引擎、关键词、关联关键词和站内关键字；
</li>
<li>用户选择什么样的入口形式（广告或者网站入口链接）更为有效；
</li>
<li>用户访问网站流程，用来分析页面结构设计是否合理；
</li>
<li>用户在页面上的网页热点图分布数据和网页覆盖图数据；
</li>
<li>用户在不同时段的访问量情况等：
</li>
<li>用户是否对于网站的字体颜色的喜好程度。
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 接入数据模型</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 数据模型</h4>
<div class="outline-text-4" id="text-1-3-1">

</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 报文格式定义</h4>
<div class="outline-text-4" id="text-1-3-2">

</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> 参数定义与规范</h4>
<div class="outline-text-4" id="text-1-3-3">


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> WFT客户端如何接入</h3>
<div class="outline-text-3" id="text-1-4">



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 正文请求</h4>
<div class="outline-text-4" id="text-1-4-1">

</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 列表请求</h4>
<div class="outline-text-4" id="text-1-4-2">


</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 手机客户端如何接入</h3>
<div class="outline-text-3" id="text-1-5">



</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 正文请求</h4>
<div class="outline-text-4" id="text-1-5-1">


</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 相关参数定义</h3>
<div class="outline-text-3" id="text-1-6">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-06-29T18:33+0800</p>
<p class="author">Author: ym</p>
<p class="creator"><a href="http://orgmode.org/">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>


</body></html>